#ifndef __CHECHDATA_H__
#define __CHECHDATA_H__
/*****************************************************************************/
/*  File      : checkdata.h                                                  */
/*****************************************************************************/
/*  History:                                                                 */
/*****************************************************************************/
/*  Date       * Author          * Changes                                   */
/*****************************************************************************/
/*  2017-03-05 * Shengfeng Dong  * Creation of the file                      */
/*             *                 *                                           */
/*****************************************************************************/

/*****************************************************************************/
/*  Include Files                                                            */
/*****************************************************************************/
#include "variation.h"
#include "debug.h"

/*****************************************************************************/
/*  Function Declarations                                                    */
/*****************************************************************************/

int check_yc200_yc250(struct inverter_info_t *inverter);		//在解析函数的最后调用
int check_yc500(struct inverter_info_t *inverter);		//在解析函数的最后调用
int check_yc1000(struct inverter_info_t *inverter);		//在解析函数的最后调用
int check_optimizer_YC500(struct inverter_info_t *inverter);

#endif /*__CHECHDATA_H__*/
